#+begin_src python :exports results :session :results latex append
  import pandas as pd
  d = pd.DataFrame()
  d['A'] = list(range(1,9))
  d['B'] = list(range(10,18))
  df = d
  d['C'] = list(range(20,28))
  d.to_latex()
  df.to_latex()
#+end_src

#+RESULTS:
#+begin_export latex
\begin{tabular}{lrrr}
\toprule
{} &  A &   B &   C \\
\midrule
0 &  1 &  10 &  20 \\
1 &  2 &  11 &  21 \\
2 &  3 &  12 &  22 \\
3 &  4 &  13 &  23 \\
4 &  5 &  14 &  24 \\
5 &  6 &  15 &  25 \\
6 &  7 &  16 &  26 \\
7 &  8 &  17 &  27 \\
\bottomrule
\end{tabular}
#+end_export
#+BEGIN_LaTeX
\begin{tabular}{lrrr}
\toprule
{} &  A &   B &   C \\
\midrule
0 &  1 &  10 &  20 \\
1 &  2 &  11 &  21 \\
2 &  3 &  12 &  22 \\
3 &  4 &  13 &  23 \\
4 &  5 &  14 &  24 \\
5 &  6 &  15 &  25 \\
6 &  7 &  16 &  26 \\
7 &  8 &  17 &  27 \\
\bottomrule
\end{tabular}
#+END_LaTeX


#+begin_src ipython :exports results :session :results :ipyfile /tmp/image.png
   import seaborn as sns
   f = 9878
   import pandas as pd
   d = pd.DataFrame({'a': [1, 2, 4, 5, 5]})
   sns.distplot(d)

 #+end_src

 #+RESULTS:
 : # Out[1]:
 : : 9878


* TODO todo
